BenLaskowski/LiteBSD/sys/mips/pic32/machdep.c
/*
 * Copyright (c) 1988 University of Utah.
 * Copyright (c) 1992, 1993
 *      The Regents of the University of California.  All rights reserved.
 * Copyright (c) 2014 Serge Vakulenko
 *
 * This code is derived from software contributed to Berkeley by
 * the Systems Programming Group of the University of Utah Computer
 * Science Department, The Mach Operating System project at
 * Carnegie-Mellon University and Ralph Campbell.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 * 3. All advertising materials mentioning features or use of this software
 *    must display the following acknowledgement:
 *      This product includes software developed by the University of
 *      California, Berkeley and its contributors.
 * 4. Neither the name of the University nor the names of its contributors
 *    may be used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
 * OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
 * SUCH DAMAGE.
 *
 *      @(#)machdep.c   8.5 (Berkeley) 6/2/95
 */

/* from: Utah $Hdr: machdep.c 1.63 91/04/24$ */

#include <sys/param.h>
#include <sys/systm.h>
#include <sys/kernel.h>
#include <sys/map.h>
#include <sys/buf.h>
#include <sys/reboot.h>
#include <sys/conf.h>
#include <sys/callout.h>
#include <sys/mbuf.h>
#include <sys/msgbuf.h>
#include <sys/user.h>
#include <sys/exec.h>
#include <sys/mount.h>
#include <sys/syscallargs.h>
#ifdef SYSVSHM
#include <sys/shm.h>
#endif

#include <vm/vm_kern.h>

#include <machine/cpu.h>
#include <machine/reg.h>
#include <machine/psl.h>
#include <machine/pte.h>
#include <machine/pic32mz.h>
#include <machine/pic32_gpio.h>
#include <machine/assym.h>

/* the following is used externally (sysctl_hw) */
char    machine[] = "MIPS";     /* cpu "architecture" */
char    machine_arch[] = "mipsel";     /* used in "uname -p" */
char    cpu_model[30];

vm_map_t buffer_map;

/*
 * Declare these as initialized data so we can patch them.
 */
int     nswbuf = 0;

#ifndef NBUF
#define NBUF 0
#endif
int     nbuf = NBUF;

#ifndef BUFPAGES
#define BUFPAGES 0
#endif
int     bufpages = BUFPAGES;

int     msgbufmapped = 0;       /* set when safe to use msgbuf */
int     physmem;                /* max supported memory, in pages */

/*
 * safepri is a safe priority for sleep to set for a spin-wait
 * during autoconfiguration or after a panic.
 */
int     safepri = PSL_LOWIPL;

struct  user *proc0paddr;
struct  proc nullproc;          /* for use by swtch_exit() */

int     dumpmag = (int)0x8fca0101;      /* magic number for savecore */
int     dumpsize = 0;                   /* also for savecore */
long    dumplo = 0;

#if defined(MEBII) || defined(SNADPIC) || defined(EMZ64)
/*
 * Chip configuration.
 */
PIC32_DEVCFG (
    DEVCFG0_JTAG_DISABLE |      /* Disable JTAG port */
    DEVCFG0_TRC_DISABLE,        /* Disable trace port */

    /* Using primary oscillator with external crystal 24 MHz.
     * PLL multiplies it to 200 MHz. */
    DEVCFG1_FNOSC_SPLL |        /* System clock supplied by SPLL */
    DEVCFG1_POSCMOD_EXT |       /* External generator */
    DEVCFG1_FCKS_ENABLE |       /* Enable clock switching */
    DEVCFG1_FCKM_ENABLE |       /* Enable fail-safe clock monitoring */
    DEVCFG1_IESO |              /* Internal-external switch over enable */
    DEVCFG1_CLKO_DISABLE,       /* CLKO output disable */

    DEVCFG2_FPLLIDIV_3 |        /* PLL input divider = 3 */
    DEVCFG2_FPLLRNG_5_10 |      /* PLL input range is 5-10 MHz */
    DEVCFG2_FPLLMULT(50) |      /* PLL multiplier = 50x */
    DEVCFG2_FPLLODIV_2,         /* PLL postscaler = 1/2 */

    DEVCFG3_FETHIO |            /* Default Ethernet pins */
    DEVCFG3_USERID(0xffff));    /* User-defined ID */
#endif

#if defined(HMZ144)
PIC32_DEVCFG (
    DEVCFG0_JTAG_DISABLE |      /* Disable JTAG port */
    DEVCFG0_TRC_DISABLE,        /* Disable trace port */

    /* Using primary oscillator with crystal 12 MHz.
     * PLL multiplies it to 200 MHz. */
    DEVCFG1_FNOSC_SPLL |        /* use system PLL */
    DEVCFG1_POSCMOD_HS |        /* primary oscillator HS mode */
    DEVCFG1_FSOSCEN |           /* Enable secondary oscillator */
    DEVCFG1_FCKM_ENABLE |       /* Enable fail-safe clock monitoring */
    DEVCFG1_IESO |              /* Internal-external switch over enable */
    DEVCFG1_CLKO_DISABLE,       /* CLKO output disable */

    DEVCFG2_FPLLIDIV_3 |        /* PLL input divider = 2 */
    DEVCFG2_FPLLRNG_5_10 |      /* PLL input range is 5-10 MHz */
    DEVCFG2_FPLLMULT(100) |     /* PLL multiplier = 100x */
    DEVCFG2_FPLLODIV_2,         /* PLL postscaler = 1/3 */

    DEVCFG3_FETHIO |            /* Default Ethernet pins */
    DEVCFG3_USERID(0xffff));    /* User-defined ID */
#endif

#if defined(MZDA_STARTER)
PIC32MZDA_DEVCFG (
//    33222222222211111111110000000000
//    10987654321098765432109876543210
    0b11111101111110111111111111010000, // normal EJTAG, POSC AGC on, 
                                        // max AGC delay, POSCFG3, POSCBOOST on,
                                        // POSCCG3, SOSCBOOST off, SOSCGAIN G3,
                                        // normal MCLR, full debug permissions,
                                        // flash can sleep, ECC disabled, MIPS32,
                                        // TRC off, PGED/PGEC2, JTAG off, debug on
    
    0b01011101011101000011111000111001, // DMT off, 2^31 DMT, 50% WDT window,
                                        // WDT off, WDT non-windowed, WDT stops
                                        // during flash programming, 2^20 WDT PS,
                                        // clock switching disabled, CLKO disabled,
                                        // HS osc, IESO disabled, SOSC disabled,
                                        // 127/128 DMT window, SPLL osc

    0b11111111111110011011000100101010, // 24 MHz USB input, deep sleep on wait,
                                        // DSWDT on, LPRC for DSWDT, 2^36 DSWDT PS,
                                        // DSBOR on, VBAT BOR on, PLL ODIV = 2,
                                        // PLL mult = 100, PLL input = primary,
                                        // 8 - 16 MHz PLL input, PLL IDIV = 3

    0b11111110111101011111111111111111, // PPS 1 config, PMD 1 config, PGL 1 config,
                                        // default Ethernet pins, RMII, 32 MB DDR,
                                        // 0xFFFF user ID

