BenLaskowski/LiteBSD/sys/mips/pic32/machdep.c
    0b11110100111111111111111111111111);// 2^20 WDT PS in sleep mode
#endif


#if defined(MEBII) || defined(HMZ144) || defined(SNADPIC) || defined(EMZ64) || defined(MZDA_STARTER)
/*
 * Boot code at bfc00000.
 * Jump to Flash memory.
 */
asm ("          .section .startup,\"ax\",@progbits");
asm ("          .globl  _boot");
asm ("          .type   _boot, function");
asm ("_boot:    la      $ra, start");
asm ("          jr      $ra");
asm ("          .text");
#endif

/*
 * Check whether button 1 is pressed.
 */
static inline int
button1_pressed()
{
#ifndef BUTTON1_PORT
    return 0;
#else
    int val;

    val = PORT_VAL(BUTTON1_PORT);
#ifdef BUTTON1_INVERT
    val = ~val;
#endif
    return (val >> BUTTON1_PIN) & 1;
#endif
}

/*
 * Do all the stuff that locore normally does before calling main().
 */
void
mach_init()
{
    int i;
    unsigned firstaddr;
    caddr_t v, start;
    const char *model = 0;
    extern char __data_start[], _edata[], _end[];
    extern void _etext(), _tlb_vector();

    /* Initialize STATUS register: master interrupt disable.
     * Setup interrupt vector base. */
    mtc0_Status(MACH_Status_CU0 | MACH_Status_BEV);
    mtc0_EBase(_tlb_vector);
    mtc0_Status(MACH_Status_CU0);

    /* Set vector spacing: not used really, but must be nonzero. */
    mtc0_IntCtl(32);

    /* Clear CAUSE register: use special interrupt vector 0x200. */
    mtc0_Cause(MACH_Cause_IV);

    /* Copy .data image from flash to RAM.
     * Linker places it at the end of .text segment. */
    bcopy(_etext, __data_start, _edata - __data_start);

    /* Clear .bss segment. */
    v = (caddr_t)mips_round_page(_end);
    bzero(_edata, v - _edata);

    /*
     * Assign console pins, board specific.
     */
#if defined(MEBII)
    /* Microchip MEB-II board: use UART1 for console.
     * Map signals rx=RA14, tx=RA15 to pins 4,6 at PICtail connector. */
    U1RXR = 13;             /* Group 1: 1101 = RA14 */
    RPA15R = 1;             /* Group 2: 0001 = U1TX */
#endif

#if defined(HMZ144) || defined(SNADPIC)
    /* Olimex HMZ144 board, SnadPIC board: use UART2 for console.
     * Map signals rx=RE9, tx=RE8. */
    ANSELECLR = (1 << 8) |
                (1 << 9);   /* Set digital mode for RE8 and RE9 */
    U2RXR = 13;             /* Group 3: 1101 = RE9 */
    RPE8R = 2;              /* Group 4: 0010 = U2TX */
#endif

#if defined(EMZ64)
    /* Olimex EMZ64 board: use UART4 for console.
     * Map signals rx=RD0, tx=RD4. */
    U4RXR = 3;              /* Group 4: 0011 = RD0 */
    RPD4R = 2;              /* Group 3: 0010 = U4TX */

    /* Enable the Ethernet PHY chip. */
    LATBSET = 1 << 11;      /* set RB11 high for EPHY-RST# */
    TRISBCLR = 1 << 11;     /* set RB11 as output */
#endif

#if defined(MZDA_STARTER)
	/* Microchip MZ DA starter board:  use UART2 for console
	 * Map signals rx=RB0 (RPB0/AN0), tx=RG9 (RPG9/AN23. */
	SYSKEY = 0xAA996655;    /* unlock sequence so we can remap pins */
	SYSKEY = 0x556699AA;
	CFGCON &= ~(1<<13);
	ANSELBCLR = 1 << 0;     /* analog disable on RB0 and RG9 */
	ANSELGCLR = 1 << 9;
	U2RXR = 5;              /* U2RX on RPB0 */
	RPG9R = 2;              /* U2TX on RPG9 */
    
    /* set up SPI port here too - is this done elsewhere? */
    SDI2R = 14;             /* SDI2 on RPD7 */
    RPG8R = 6;              /* SDO2 on RPG8 */
	CFGCON |= 1 << 13;		/* lock the config again */
	SYSKEY = 0x33333333;
#endif
	 

    /*
     * Enable buttons.
     */
#ifdef BUTTON1_PORT
    ANSEL_CLR(BUTTON1_PORT) = 1 << BUTTON1_PIN;
    TRIS_SET(BUTTON1_PORT) = 1 << BUTTON1_PIN;
#ifdef BUTTON1_INVERT
    /* Active low - enable Pull Up resistor. */
    CNPU_SET(BUTTON1_PORT) = 1 << BUTTON1_PIN;
#else
    /* Active high - enable Pull Down resistor. */
    CNPD_SET(BUTTON1_PORT) = 1 << BUTTON1_PIN;
#endif
#endif
#ifdef BUTTON2_PORT
    ANSEL_CLR(BUTTON2_PORT) = 1 << BUTTON2_PIN;
    TRIS_SET(BUTTON2_PORT) = 1 << BUTTON2_PIN;
#ifdef BUTTON2_INVERT
    /* Active low - enable Pull Up resistor. */
    CNPU_SET(BUTTON2_PORT) = 1 << BUTTON2_PIN;
#else
    /* Active high - enable Pull Down resistor. */
    CNPD_SET(BUTTON2_PORT) = 1 << BUTTON2_PIN;
#endif
#endif
#ifdef BUTTON3_PORT
    ANSEL_CLR(BUTTON3_PORT) = 1 << BUTTON3_PIN;
    TRIS_SET(BUTTON3_PORT) = 1 << BUTTON3_PIN;
#ifdef BUTTON3_INVERT
    /* Active low - enable Pull Up resistor. */
    CNPU_SET(BUTTON3_PORT) = 1 << BUTTON3_PIN;
#else
    /* Active high - enable Pull Down resistor. */
    CNPD_SET(BUTTON3_PORT) = 1 << BUTTON3_PIN;
#endif
#endif

    /*
     * Autoboot by default.
     */
    boothowto = 0;
    if (button1_pressed()) {
        /* Boot to single user mode. */
        boothowto |= RB_SINGLE;
    }

    /*
     * Init mapping for u page(s) for proc[0], pm_tlbpid 1.
     */
    start = v;
    proc0paddr = (struct user *)v;
    curproc->p_addr = proc0paddr;
    curproc->p_md.md_regs = proc0paddr->u_pcb.pcb_regs;
    firstaddr = MACH_VIRT_TO_PHYS(v);
    for (i = 0; i < UPAGES; i++) {
        curproc->p_md.md_upte[i] = PG_PFNUM(firstaddr) | PG_UNCACHED | PG_V | PG_D;
        firstaddr += NBPG;
    }
    tlb_write_wired(0, UADDR | 1, curproc->p_md.md_upte[0],
                                  curproc->p_md.md_upte[1]);
    v += UPAGES * NBPG;
    tlb_set_pid(1);

    /*
     * init nullproc for swtch_exit().
     * init mapping for u page(s), pm_tlbpid 0
     * This could be used for an idle process.
     */
    nullproc.p_addr = (struct user *)v;
    nullproc.p_md.md_regs = nullproc.p_addr->u_pcb.pcb_regs;
    bcopy("nullproc", nullproc.p_comm, sizeof("nullproc"));
    for (i = 0; i < UPAGES; i++) {
        nullproc.p_md.md_upte[i] = PG_PFNUM(firstaddr) | PG_UNCACHED | PG_V | PG_D;
        firstaddr += NBPG;
    }
    v += UPAGES * NBPG;

    /* clear pages for u areas */
    bzero(start, v - start);

    switch (DEVID & 0x0fffffff) {
    case 0x05104053: model = "PIC32MZ2048ECG064"; break;
    case 0x0510E053: model = "PIC32MZ2048ECG100"; break;
    case 0x05118053: model = "PIC32MZ2048ECG124"; break;
    case 0x05122053: model = "PIC32MZ2048ECG144"; break;
    case 0x05109053: model = "PIC32MZ2048ECH064"; break;
    case 0x05113053: model = "PIC32MZ2048ECH100"; break;
    case 0x0511D053: model = "PIC32MZ2048ECH124"; break;
    case 0x05127053: model = "PIC32MZ2048ECH144"; break;
    case 0x05131053: model = "PIC32MZ2048ECM064"; break;
    case 0x0513B053: model = "PIC32MZ2048ECM100"; break;
    case 0x05145053: model = "PIC32MZ2048ECM124"; break;
    case 0x0514F053: model = "PIC32MZ2048ECM144"; break;
    case 0x07203053: model = "PIC32MZ1024EFG064"; break;
    case 0x07208053: model = "PIC32MZ1024EFH064"; break;
    case 0x07230053: model = "PIC32MZ1024EFM064"; break;
    case 0x07204053: model = "PIC32MZ2048EFG064"; break;
    case 0x07209053: model = "PIC32MZ2048EFH064"; break;
    case 0x07231053: model = "PIC32MZ2048EFM064"; break;
    case 0x0720D053: model = "PIC32MZ1024EFG100"; break;
    case 0x07212053: model = "PIC32MZ1024EFH100"; break;
    case 0x0723A053: model = "PIC32MZ1024EFM100"; break;
    case 0x0720E053: model = "PIC32MZ2048EFG100"; break;
    case 0x07213053: model = "PIC32MZ2048EFH100"; break;
    case 0x0723B053: model = "PIC32MZ2048EFM100"; break;
    case 0x07217053: model = "PIC32MZ1024EFG124"; break;
    case 0x0721C053: model = "PIC32MZ1024EFH124"; break;
    case 0x07244053: model = "PIC32MZ1024EFM124"; break;
    case 0x07218053: model = "PIC32MZ2048EFG124"; break;
    case 0x0721D053: model = "PIC32MZ2048EFH124"; break;
    case 0x07245053: model = "PIC32MZ2048EFM124"; break;
    case 0x07221053: model = "PIC32MZ1024EFG144"; break;
    case 0x07226053: model = "PIC32MZ1024EFH144"; break;
    case 0x0724E053: model = "PIC32MZ1024EFM144"; break;
    case 0x07222053: model = "PIC32MZ2048EFG144"; break;
    case 0x07227053: model = "PIC32MZ2048EFH144"; break;
    case 0x0724F053: model = "PIC32MZ2048EFM144"; break;
    case 0x05F4E053: model = "PIC32MZ2064DAG169"; break;
    case 0x05F4F053: model = "PIC32MZ2064DAH169"; break;
    case 0x05FBA053: model = "PIC32MZ2064DAG176"; break;
    case 0x05FBB053: model = "PIC32MZ2064DAH176"; break;
    }
    if (model)
        strcpy(cpu_model, model);
    else
        sprintf(cpu_model, "PIC32MZ DevID %x", DEVID);

