BenLaskowski/LiteBSD/sys/mips/pic32/machdep.c
    /* 184 - I2C5 Master Event
     * 185 - SPI6 Fault
     * 186 - SPI6 Receive Done
     * 187 - SPI6 Transfer Done */
    IPC(46) = PIC32_IPC_IP(0, LSPI, LSPI, LSPI);

    /* 188 - UART6 Fault
     * 189 - UART6 Receive Done
     * 190 - UART6 Transfer Done
     * 191 - Reserved */
    IPC(47) = PIC32_IPC_IP(LUART, LUART, LUART, 0);

    /* Read processor ID register. */
    cpu.cpuprid = mfc0_PRId();

    /*
     * Enable instruction prefetch.
     */
    PRECON = 2;                 /* Two wait states. */
    PRECONSET = 0x30;           /* Enable predictive prefetch for any address */
}

void
initcpu()
{
    /* disable clock interrupts (until startrtclock()) */
#if 0
    // TODO: pic32
    register volatile struct chiptime *c = Mach_clock_addr;
    c->regb = REGB_DATA_MODE | REGB_HOURS_FORMAT;
    (void) c->regc;
#endif

    /* Enable software interrupts. */
    IECSET(0) = 1 << PIC32_IRQ_CS0;     /* softclock */
    IECSET(0) = 1 << PIC32_IRQ_CS1;     /* softnet */

    /* Safe to turn interrupts on now. */
    spl0();
}

static void
identify_cpu()
{
    unsigned osccon = OSCCON, spllcon = SPLLCON;
    unsigned pllmult = (spllcon >> 16 & 127) + 1;
    unsigned pllidiv = (spllcon >> 8 & 7) + 1;
    unsigned pllodiv = "\2\2\4\10\20\40\40\40"[spllcon >> 24 & 7];
    static const char *poscmod[] = { "external clock", "(reserved)",
                                     "crystal", "(disabled)" };

    printf("cpu: %s rev A%u, %u MHz\n",
        cpu_model, DEVID >> 28, CPU_KHZ/1000);

    /* COSC: current oscillator selection bits */
    printf("oscillator: ");
    switch (osccon >> 12 & 7) {
    case 0:
    case 7:
        printf("internal Fast RC, divided\n");
        break;
    case 1:
        printf("system PLL div 1:%d mult x%d\n",
                pllidiv * pllodiv, pllmult);
        break;
    case 2:
        printf("%s\n", poscmod [DEVCFG1 >> 8 & 3]);
        break;
    case 3:
        printf("reserved\n");
        break;
    case 4:
        printf("secondary\n");
        break;
    case 5:
        printf("internal Low-Power RC\n");
        break;
    case 6:
        printf("back-up Fast RC\n");
        break;
    }

    /*
     * Compute cache sizes.
     */
    unsigned config1 = mfc0_Config1();
    unsigned il = config1 >> 19 & 7;
    unsigned dl = config1 >> 10 & 7;

    machInstCacheSize = 0;
    machDataCacheSize = 0;
    if (il > 0) {
        unsigned is = config1 >> 22 & 7;
        unsigned ia = config1 >> 16 & 7;
        machInstCacheSize = 64 * (1<<is) * 2 * (1<<il) * (ia+1);
    }
    if (dl > 0) {
        unsigned ds = config1 >> 13 & 7;
        unsigned da = config1 >> 7 & 7;
        machDataCacheSize = 64 * (1<<ds) * 2 * (1<<dl) * (da+1);
    }
    if (machInstCacheSize > 0 || machDataCacheSize > 0) {
        printf("cache: %u/%u kbytes\n",
            machInstCacheSize >> 10, machDataCacheSize >> 10);
    }
}

/*
 * File assym.h is incorrect - print the message and panic.
 */
static void
bad_assym(int *error, const char *name, unsigned value)
{
    if (! *error) {
        printf("Fatal error: file sys/mips/include/assym.h is incorrect.\n");
        printf("Please, update the following values and rebuild the kernel:\n");
        *error = 1;
    }
    printf("    #define %s %d\n", name, value);
}

/*
 * Verify assembler symbols.
 * File sys/mips/include/assym.h contains declarations of field offsets
 * of struct proc, user and vmmeter for assembler routines.
 * Here we verify that these values do match our expectations.
 */
static void
verify_assym()
{
    register struct proc *p = 0;
    register struct user *up = 0;
    register struct vmmeter *vm = 0;
    int error = 0;

    /* Offsets for struct proc */
    if (P_FORW != (unsigned)&p->p_forw)
        bad_assym(&error, "P_FORW", (unsigned)&p->p_forw);
    if (P_BACK != (unsigned)&p->p_back)
        bad_assym(&error, "P_BACK", (unsigned)&p->p_back);
    if (P_PRIORITY != (unsigned)&p->p_priority)
        bad_assym(&error, "P_PRIORITY", (unsigned)&p->p_priority);
    if (P_UPTE != (unsigned)p->p_md.md_upte)
        bad_assym(&error, "P_UPTE", (unsigned)p->p_md.md_upte);

    /* Offsets for struct user */
    if (U_PCB_REGS != (unsigned)up->u_pcb.pcb_regs)
        bad_assym(&error, "U_PCB_REGS", (unsigned)up->u_pcb.pcb_regs);
    if (U_PCB_FPREGS != (unsigned)&up->u_pcb.pcb_regs[F0])
        bad_assym(&error, "U_PCB_FPREGS", (unsigned)&up->u_pcb.pcb_regs[F0]);
    if (U_PCB_CONTEXT != (unsigned)&up->u_pcb.pcb_context)
        bad_assym(&error, "U_PCB_CONTEXT", (unsigned)&up->u_pcb.pcb_context);
    if (U_PCB_ONFAULT != (unsigned)&up->u_pcb.pcb_onfault)
        bad_assym(&error, "U_PCB_ONFAULT", (unsigned)&up->u_pcb.pcb_onfault);
    if (U_PCB_SEGTAB != (unsigned)&up->u_pcb.pcb_segtab)
        bad_assym(&error, "U_PCB_SEGTAB", (unsigned)&up->u_pcb.pcb_segtab);

    /* Offsets for struct vmmeter */
    if (V_SWTCH != (unsigned)&vm->v_swtch)
        bad_assym(&error, "V_SWTCH", (unsigned)&vm->v_swtch);

    if (error)
        panic("assym");
}

/*
 * cpu_startup: allocate memory for variable-sized tables,
 * initialize cpu, and do autoconfiguration.
 */
void
cpu_startup()
{
    register unsigned i;
    int base, residual;
    vm_offset_t minaddr, maxaddr;
    vm_size_t size;

    /*
     * Good {morning,afternoon,evening,night}.
     */
    printf(version);
    identify_cpu();
    verify_assym();
    printf("real mem = %d kbytes\n", ctob(physmem) >> 10);
#if 0
printf("callout  = %08x, %u entries, %u bytes\n", callout, ncallout, ncallout * sizeof(struct callout));
printf("swapmap  = %08x, %u entries, %u bytes\n", swapmap, nswapmap, nswapmap * sizeof(struct map));
printf("shmsegs  = %08x, %u entries, %u bytes\n", shmsegs, shminfo.shmmni, shminfo.shmmni * sizeof(struct shmid_ds));
printf("swbuf    = %08x, %u entries, %u bytes\n", swbuf, nswbuf, nswbuf * sizeof(struct buf));
printf("buf      = %08x, %u entries, %u bytes\n", buf, nbuf, nbuf * sizeof(struct buf));
printf("Sysmap   = %08x, %u entries, %u bytes\n", Sysmap, Sysmapsize, Sysmapsize * sizeof(pt_entry_t));
printf("pmap_attributes = %08x, %u entries, %u bytes\n", pmap_attributes, physmem, physmem);
printf("pv_table = %08x, %u entries, %u bytes\n", pv_table, pv_tabsz, pv_tabsz * 12);

printf("avail_start = %08x, avail_end = %08x\n", avail_start, avail_end);
#endif

