BenLaskowski/LiteBSD/sys/mips/pic32/machdep.c
    /*
     * Allocate virtual address space for file I/O buffers.
     * Note they are different than the array of headers, 'buf',
     * and usually occupy more virtual memory than physical.
     */
    size = MAXBSIZE * nbuf;
    buffer_map = kmem_suballoc(kernel_map, (vm_offset_t *)&buffers,
                   &maxaddr, size, TRUE);
    minaddr = (vm_offset_t)buffers;
    if (vm_map_find(buffer_map, vm_object_allocate(size), (vm_offset_t)0,
            &minaddr, size, FALSE) != KERN_SUCCESS)
        panic("startup: cannot allocate buffers");
    base = bufpages / nbuf;
    residual = bufpages % nbuf;
    for (i = 0; i < nbuf; i++) {
        vm_size_t curbufsize;
        vm_offset_t curbuf;

        /*
         * First <residual> buffers get (base+1) physical pages
         * allocated for them.  The rest get (base) physical pages.
         *
         * The rest of each buffer occupies virtual space,
         * but has no physical memory allocated for it.
         */
        curbuf = (vm_offset_t)buffers + i * MAXBSIZE;
        curbufsize = CLBYTES * (i < residual ? base+1 : base);
        vm_map_pageable(buffer_map, curbuf, curbuf+curbufsize, FALSE);
        vm_map_simplify(buffer_map, curbuf);
    }

    /*
     * Allocate a submap for physio
     */
    phys_map = kmem_suballoc(kernel_map, &minaddr, &maxaddr,
                 VM_PHYS_SIZE, TRUE);
    /*
     * Finally, allocate mbuf pool.  Since mclrefcnt is an off-size
     * we use the more space efficient malloc in place of kmem_alloc.
     */
    mclrefcnt = (char *)malloc(NMBCLUSTERS+CLBYTES/MCLBYTES,
                   M_MBUF, M_NOWAIT);
    bzero(mclrefcnt, NMBCLUSTERS+CLBYTES/MCLBYTES);
    mb_map = kmem_suballoc(kernel_map, (vm_offset_t *)&mbutl, &maxaddr,
                   VM_MBUF_SIZE, FALSE);
    /*
     * Initialize callouts
     */
    callfree = callout;
    for (i = 1; i < ncallout; i++)
        callout[i-1].c_next = &callout[i];
    callout[i-1].c_next = NULL;

    printf("avail mem = %d kbytes\n", ptoa(cnt.v_free_count) >> 10);
    printf("using %d buffers containing %d bytes of memory\n",
        nbuf, bufpages * CLBYTES);
    /*
     * Set up CPU-specific registers, cache, etc.
     */
    initcpu();

    /*
     * Set up buffers, so they can be used to read disk labels.
     */
    bufinit();

    /*
     * Configure the system.
     */
    configure();
}

/*
 * Set registers on exec.
 * Clear all registers except sp, pc.
 */
void
setregs(p, entry)
    register struct proc *p;
    u_long entry;
{
    int sp = p->p_md.md_regs[SP];

    bzero((caddr_t)p->p_md.md_regs, (FSR + 1) * sizeof(int));
    p->p_md.md_regs[SP] = sp;
    p->p_md.md_regs[PC] = entry & ~3;
    p->p_md.md_regs[SR] = PSL_USERSET | MACH_Status_EXL;
    p->p_md.md_flags &= ~MDP_FPUSED;
}

/*
 * WARNING: code in locore.s assumes the layout shown for sf_signum
 * thru sf_handler so... don't screw with them!
 */
struct sigframe {
    int     sf_signum;              /* signo for handler */
    int     sf_code;                /* additional info for handler */
    struct  sigcontext *sf_scp;     /* context ptr for handler */
    sig_t   sf_handler;             /* handler addr for u_sigc */
    struct  sigcontext sf_sc;       /* actual context */
};

/*
 * Send an interrupt to process.
 */
void
sendsig(catcher, sig, mask, code)
    sig_t catcher;
    int sig, mask;
    u_long code;
{
    register struct proc *p = curproc;
    register struct sigframe *fp;
    register int *regs;
    register struct sigacts *psp = p->p_sigacts;
    int oonstack, fsize;
    struct sigcontext ksc;
    extern char sigcode[], esigcode[];

    regs = p->p_md.md_regs;
    oonstack = psp->ps_sigstk.ss_flags & SA_ONSTACK;
    /*
     * Allocate and validate space for the signal handler
     * context. Note that if the stack is in data space, the
     * call to grow() is a nop, and the copyout()
     * will fail if the process has not already allocated
     * the space with a `brk'.
     */
    fsize = sizeof(struct sigframe);
    if ((psp->ps_flags & SAS_ALTSTACK) &&
        (psp->ps_sigstk.ss_flags & SA_ONSTACK) == 0 &&
        (psp->ps_sigonstack & sigmask(sig))) {
        fp = (struct sigframe *)(psp->ps_sigstk.ss_base +
            psp->ps_sigstk.ss_size - fsize);
        psp->ps_sigstk.ss_flags |= SA_ONSTACK;
    } else
        fp = (struct sigframe *)(regs[SP] - fsize);
    if ((unsigned)fp <= USRSTACK - ctob(p->p_vmspace->vm_ssize))
        (void)grow(p, (unsigned)fp);

    /*
     * Build the signal context to be used by sigreturn.
     */
    ksc.sc_onstack = oonstack;
    ksc.sc_mask = mask;
    ksc.sc_pc = regs[PC];
    ksc.sc_regs[ZERO] = 0xACEDBADE;         /* magic number */
    bcopy((caddr_t)&regs[1], (caddr_t)&ksc.sc_regs[1],
        sizeof(ksc.sc_regs) - sizeof(int));
    ksc.sc_fpused = p->p_md.md_flags & MDP_FPUSED;
    if (copyout((caddr_t)&ksc, (caddr_t)&fp->sf_sc, sizeof(ksc))) {
        /*
         * Process has trashed its stack; give it an illegal
         * instruction to halt it in its tracks.
         */
        SIGACTION(p, SIGILL) = SIG_DFL;
        sig = sigmask(SIGILL);
        p->p_sigignore &= ~sig;
        p->p_sigcatch &= ~sig;
        p->p_sigmask &= ~sig;
        psignal(p, SIGILL);
        return;
    }

    /*
     * Build the argument list for the signal handler.
     */
    regs[A0] = sig;
    regs[A1] = code;
    regs[A2] = (int)&fp->sf_sc;
    regs[A3] = (int)catcher;
    regs[PC] = (int)catcher;
    regs[SP] = (int)fp;

    /*
     * Signal trampoline code is at base of user stack.
     */
    regs[RA] = (int)PS_STRINGS - (esigcode - sigcode);
}

/*
 * System call to cleanup state after a signal
 * has been taken.  Reset signal mask and
 * stack state from context left by sendsig (above).
 * Return to previous pc and psl as specified by
 * context left by sendsig. Check carefully to
 * make sure that the user has not modified the
 * psl to gain improper priviledges or to cause
 * a machine fault.
 */
/* ARGSUSED */
int
sigreturn(p, uap, retval)
    struct proc *p;
    struct sigreturn_args /* {
        syscallarg(struct sigcontext *) sigcntxp;
    } */ *uap;
    register_t *retval;
{
    register struct sigcontext *scp;
    register int *regs;
    struct sigcontext ksc;
    int error;

    scp = SCARG(uap, sigcntxp);
    regs = p->p_md.md_regs;
    /*
     * Test and fetch the context structure.
     * We grab it all at once for speed.
     */
    error = copyin((caddr_t)scp, (caddr_t)&ksc, sizeof(ksc));
    if (error || ksc.sc_regs[ZERO] != 0xACEDBADE) {
        return (EINVAL);
    }
    scp = &ksc;
    /*
     * Restore the user supplied information
     */
    if (scp->sc_onstack & 01)
        p->p_sigacts->ps_sigstk.ss_flags |= SA_ONSTACK;
    else
        p->p_sigacts->ps_sigstk.ss_flags &= ~SA_ONSTACK;
    p->p_sigmask = scp->sc_mask &~ sigcantmask;
    regs[PC] = scp->sc_pc;
    bcopy((caddr_t)&scp->sc_regs[1], (caddr_t)&regs[1],
        sizeof(scp->sc_regs) - sizeof(int));
    if (scp->sc_fpused)
        bcopy((caddr_t)scp->sc_fpregs, (caddr_t)&p->p_md.md_regs[F0],
            sizeof(scp->sc_fpregs));
    return (EJUSTRETURN);
}

