BenLaskowski/LiteBSD/sys/mips/pic32/machdep.c
/*
 * Boot comes here after turning off memory management and
 * getting on the dump stack, either when called above, or by
 * the auto-restart code.
 */
static void
dumpsys()
{
    int error;

    msgbufmapped = 0;
    if (dumpdev == NODEV)
        return;
    /*
     * For dumps during autoconfiguration,
     * if dump device has already configured...
     */
    if (dumpsize == 0)
        dumpconf();
    if (dumplo < 0)
        return;
    printf("\ndumping to dev %x, offset %d\n", dumpdev, dumplo);
    printf("dump ");
    error = (*bdevsw[major(dumpdev)].d_dump)(dumpdev);
    switch (error) {

    case ENXIO:
        printf("device bad\n");
        break;

    case EFAULT:
        printf("device not ready\n");
        break;

    case EINVAL:
        printf("area improper\n");
        break;

    case EIO:
        printf("i/o error\n");
        break;

    default:
        printf("error %d\n", error);
        break;

    case 0:
        printf("succeeded\n");
    }
}

int     waittime = -1;

void
boot(howto)
    register int howto;
{
    struct proc *p = curproc;       /* XXX */

    /* take a snap shot before clobbering any registers */
    if (curproc)
        savectx(curproc->p_addr);

    boothowto = howto;
    if ((howto & RB_NOSYNC) == 0 && waittime < 0) {
        register struct buf *bp;
        int iter, nbusy;

        waittime = 0;
        (void) spl0();
        printf("syncing disks... ");
        /*
         * Release vnodes held by texts before sync.
         */
        if (panicstr == 0)
            vnode_pager_umount(NULL);
        sync(p, (void *)NULL, (int *)NULL);

        /*
         * Unmount filesystems
         */
        if (panicstr == 0)
            vfs_unmountall();

        for (iter = 0; iter < 20; iter++) {
            nbusy = 0;
            for (bp = &buf[nbuf]; --bp >= buf; )
                if ((bp->b_flags & (B_BUSY|B_INVAL)) == B_BUSY)
                    nbusy++;
            if (nbusy == 0)
                break;
            printf("%d ", nbusy);
            udelay(40000 * iter);
        }
        if (nbusy)
            printf("giving up\n");
        else
            printf("done\n");
        /*
         * If we've been adjusting the clock, the todr
         * will be out of synch; adjust it now.
         */
        resettodr();
    }

    /* Disable interrupts. */
    mips_di();

    if (! (howto & RB_HALT)) {
        if (howto & RB_DUMP) {
            dumpsys();
            udelay(1000000);
        }

        /* Unlock access to reset register */
        SYSKEY = 0;
        SYSKEY = 0xaa996655;
        SYSKEY = 0x556699aa;

        /* Reset microcontroller */
        RSWRSTSET = 1;
        (void) RSWRST;
    }
    printf ("halted\n");

    for (;;) {
        asm volatile ("wait");
    }
    /*NOTREACHED*/
}

void
dumpconf()
{
    int nblks;

    dumpsize = physmem;
    if (dumpdev != NODEV && bdevsw[major(dumpdev)].d_psize) {
        nblks = (*bdevsw[major(dumpdev)].d_psize)(dumpdev);
        if (dumpsize > btoc(dbtob(nblks - dumplo)))
            dumpsize = btoc(dbtob(nblks - dumplo));
        else if (dumplo == 0)
            dumplo = nblks - btodb(ctob(physmem));
    }

    /*
     * Don't dump on the first CLBYTES (why CLBYTES?)
     * in case the dump device includes a disk label.
     */
    if (dumplo < btodb(CLBYTES))
        dumplo = btodb(CLBYTES);
}

/*
 * Return the best possible estimate of the time in the timeval
 * to which tvp points.
 */
void
microtime(tvp)
    struct timeval *tvp;
{
    int s = splhigh();
    int delta = mfc0_Count() - mfc0_Compare();
    *tvp = time;
    splx(s);

    delta += (CPU_KHZ * 1000 / HZ + 1) / 2;
    delta /= CPU_KHZ / 2000;
    if (delta < 0) {
        /* Cannot happen. */
        delta = 0;
    } else if (delta >= 1000000) {
        /* The kernel missed the timer interrupt for a whole second.
         * Something definitely went wrong. */
        panic("microtime watchdog");
    }
    tvp->tv_usec += delta;
    while (tvp->tv_usec > 1000000) {
        tvp->tv_sec++;
        tvp->tv_usec -= 1000000;
    }
}

/*
 * Delay for a given number of microseconds.
 * The processor has a 32-bit hardware Count register,
 * which increments at half CPU rate.
 * We use it to get a precise delay.
 */
void
udelay(unsigned usec)
{
    unsigned now = mfc0_Count();
    unsigned final = now + usec * (CPU_KHZ / 2000);

    do {
        now = mfc0_Count();

        /* This comparison is valid only when using a signed type. */
    } while ((int) (now - final) < 0);
}

/*
 * Write the given pid into the TLB pid reg.
 */
void
tlb_set_pid(unsigned pid)
{
    mtc0_EntryHi(pid);                  /* Set up entry high */
    asm volatile ("ehb");               /* Hazard barrier */
}

/*
 * Write the entry into the wired part of TLB at the given index.
 */
void
tlb_write_wired(unsigned index, unsigned hi, unsigned lo0, unsigned lo1)
{
    int x = mips_di();                  /* Disable interrupts */
    int pid = mfc0_EntryHi();           /* Save the current PID */

    mtc0_Index(index);                  /* Set the index */
    mtc0_EntryHi(hi);                   /* Set up entry high */
    mtc0_EntryLo0(lo0);                 /* Set up entry low 0 */
    mtc0_EntryLo1(lo1);                 /* Set up entry low 1 */
    asm volatile ("tlbwi");             /* Write the TLB entry */

    mtc0_Wired(index + 1);              /* Set the number of wired entries */

    mtc0_EntryHi(pid);                  /* Restore the PID */
    mtc0_Status(x);                     /* Restore interrupts */
}

/*
 * Flush the "random" entries from the TLB.
 */
void
tlb_flush()
{
    int x = mips_di();                  /* Disable interrupts */
    int pid = mfc0_EntryHi();           /* Save the current PID */
    int index = VMMACH_NUM_TLB_ENTRIES;
    int addr = MACH_CACHED_MEMORY_ADDR;

    mtc0_EntryLo0(0);                   /* Zero out low entry 0 */
    mtc0_EntryLo1(0);                   /* Zero out low entry 1 */
    while (--index >= VMMACH_FIRST_RAND_ENTRY) {
        mtc0_Index(index);              /* Set the index */
        mtc0_EntryHi(addr);             /* Use invalid memory address */
        asm volatile ("tlbwi");         /* Write the TLB entry */
        addr += 2 << 13;                /* Increment address to avoid MCheck */
    }
    mtc0_EntryHi(pid);                  /* Restore the PID */
    mtc0_Status(x);                     /* Restore interrupts */
}

