BenLaskowski/LiteBSD/sys/mips/pic32/machdep.c
/*
 * Flush any TLB entries for the given address and TLB PID.
 */
void
tlb_flush_addr(unsigned hi, unsigned lo)
{
    int x, pid, index;

//printf("%s: hi=%08x, lo=%08x\n", __func__, hi, lo);
    x = mips_di();                      /* Disable interrupts */
    pid = mfc0_EntryHi();               /* Save the current PID */

    mtc0_EntryHi(hi);                   /* Look for addr & PID */
    asm volatile ("tlbp");              /* Probe for the entry */
    index = mfc0_Index();               /* See what we got */

    if (index >= 0) {
        /* Entry found. */
        asm volatile ("tlbr");          /* Read existing entry */
        mtc0_EntryHi(hi);               /* Restore addr & PID */
        if (hi & (1 << PGSHIFT)) {
            mtc0_EntryLo1(lo);          /* Clear low entry 1 */
        } else {
            mtc0_EntryLo0(lo);          /* Clear low entry 0 */
        }
        asm volatile ("tlbwi");         /* Update TLB entry */
    }
    mtc0_EntryHi(pid);                  /* Restore the PID */
    mtc0_Status(x);                     /* Restore interrupts */
}

/*
 * Update the TLB entry if highreg is found; otherwise, enter the data.
 */
void
tlb_update (unsigned hi, pt_entry_t *pte)
{
    unsigned lo0, lo1;
    int x, pid, index;

    /* Replicate G bit to paired even/odd entry. */
    if (hi & (1 << PGSHIFT)) {
        lo1 = pte[0].pt_entry;
        lo0 = pte[-1].pt_entry | (lo1 & PG_G);
    } else {
        lo0 = pte[0].pt_entry;
        lo1 = pte[1].pt_entry | (lo0 & PG_G);
    }
//printf("%s: hi=%08x, lo0=%08x, lo1=%08x\n", __func__, hi, lo0, lo1);
    x = mips_di();                      /* Disable interrupts */
    pid = mfc0_EntryHi();               /* Save the current PID */

    mtc0_EntryHi(hi);                   /* Look for addr & PID */
    asm volatile ("tlbp");              /* Probe for the entry */
    index = mfc0_Index();               /* See what we got */

    mtc0_EntryLo0(lo0);                 /* Setup low entry 0 */
    mtc0_EntryLo1(lo1);                 /* Setup low entry 1 */

    if (index >= 0) {
        /* Entry found. */
        asm volatile ("tlbwi");         /* Overwrite existing TLB entry */
    } else {
        asm volatile ("tlbwr");         /* Enter into a random slot */
    }
    mtc0_EntryHi(pid);                  /* Restore the PID */
    mtc0_Status(x);                     /* Restore interrupts */
}

/*
 * Flush instruction cache for range of addr to addr + len - 1.
 * The address can be any valid address so long as no TLB misses occur.
 */
void
mips_flush_icache(unsigned addr, unsigned len)
{
    int x = mips_di();                  /* Disable interrupts */

    // TODO
    mtc0_Status(x);                     /* Restore interrupts */
}

/*
 * Flush data cache for range of addr to addr + len - 1.
 * The address can be any valid address so long as no TLB misses occur.
 * (Be sure to use cached K0SEG kernel addresses)
 */
void
mips_flush_dcache(vm_offset_t addr, vm_offset_t len)
{
    int x = mips_di();                  /* Disable interrupts */

    // TODO
    mtc0_Status(x);                     /* Restore interrupts */
}

/*
 * Routines for access to general purpose I/O pins.
 */
static const char pin_name[16] = "?ABCDEFGHJK?????";

int gpio_input_map1(int pin)
{
    switch (pin) {
    case RP('D',2):  return 0;
    case RP('G',8):  return 1;
    case RP('F',4):  return 2;
    case RP('D',10): return 3;
    case RP('F',1):  return 4;
    case RP('B',9):  return 5;
    case RP('B',10): return 6;
    case RP('C',14): return 7;
    case RP('B',5):  return 8;
    case RP('C',1):  return 10;
    case RP('D',14): return 11;
    case RP('G',1):  return 12;
    case RP('A',14): return 13;
    case RP('D',6):  return 14;
    }
    printf("gpio: cannot map peripheral input pin %c%d, group 1\n",
        pin_name[pin>>4], pin & 15);
    return -1;
}

int gpio_input_map2(int pin)
{
    switch (pin) {
    case RP('D',3):  return 0;
    case RP('G',7):  return 1;
    case RP('F',5):  return 2;
    case RP('D',11): return 3;
    case RP('F',0):  return 4;
    case RP('B',1):  return 5;
    case RP('E',5):  return 6;
    case RP('C',13): return 7;
    case RP('B',3):  return 8;
    case RP('C',4):  return 10;
    case RP('D',15): return 11;
    case RP('G',0):  return 12;
    case RP('A',15): return 13;
    case RP('D',7):  return 14;
    }
    printf("gpio: cannot map peripheral input pin %c%d, group 2\n",
        pin_name[pin>>4], pin & 15);
    return -1;
}

int gpio_input_map3(int pin)
{
    switch (pin) {
    case RP('D',9):  return 0;
    case RP('G',6):  return 1;
    case RP('B',8):  return 2;
    case RP('B',15): return 3;
    case RP('D',4):  return 4;
    case RP('B',0):  return 5;
    case RP('E',3):  return 6;
    case RP('B',7):  return 7;
    case RP('F',12): return 9;
    case RP('D',12): return 10;
    case RP('F',8):  return 11;
    case RP('C',3):  return 12;
    case RP('E',9):  return 13;
    }
    printf("gpio: cannot map peripheral input pin %c%d, group 3\n",
        pin_name[pin>>4], pin & 15);
    return -1;
}

int gpio_input_map4(int pin)
{
    switch (pin) {
    case RP('D',1):  return 0;
    case RP('G',9):  return 1;
    case RP('B',14): return 2;
    case RP('D',0):  return 3;
    case RP('B',6):  return 5;
    case RP('D',5):  return 6;
    case RP('B',2):  return 7;
    case RP('F',3):  return 8;
    case RP('F',13): return 9;
    case RP('F',2):  return 11;
    case RP('C',2):  return 12;
    case RP('E',8):  return 13;
    }
    printf("gpio: cannot map peripheral input pin %c%d, group 4\n",
        pin_name[pin>>4], pin & 15);
    return -1;
}

void gpio_set_input(int pin)
{
    struct gpioreg *port = (struct gpioreg*) &ANSELA;

    port += (pin >> 4 & 15) - 1;
    port->trisset = (1 << (pin & 15));
    port->anselclr = (1 << (pin & 15));
}

void gpio_set_output(int pin)
{
    struct gpioreg *port = (struct gpioreg*) &ANSELA;

    port += (pin >> 4 & 15) - 1;
    port->trisclr = (1 << (pin & 15));
    port->anselclr = (1 << (pin & 15));
}

void gpio_set_analog(int pin)
{
    struct gpioreg *port = (struct gpioreg*) &ANSELA;

    port += (pin >> 4 & 15) - 1;
    port->trisset = (1 << (pin & 15));
    port->anselset = (1 << (pin & 15));
}

void gpio_set(int pin)
{
    struct gpioreg *port = (struct gpioreg*) &ANSELA;

    port += (pin >> 4 & 15) - 1;
    port->latset = (1 << (pin & 15));
}

void gpio_clr(int pin)
{
    struct gpioreg *port = (struct gpioreg*) &ANSELA;

    port += (pin >> 4 & 15) - 1;
    port->latclr = (1 << (pin & 15));
}

int gpio_get(int pin)
{
    struct gpioreg *port = (struct gpioreg*) &ANSELA;

    port += (pin >> 4 & 15) - 1;
    return ((port->port & (1 << (pin & 15))) ? 1 : 0);
}

char gpio_portname(int pin)
{
    return pin_name[(pin >> 4) & 15];
}

int gpio_pinno(int pin)
{
    return pin & 15;
}
